app/Http/Controllers/Frontend/HomeController.php

select * from `pages` where `slug` = 'setup.cgi' and `published` = 1 and `pages`.`deleted_at` is null limit 1
select * from `configs` where `key` = 'layout_1' limit 1
select * from `courses` where exists (select * from `categories` where `courses`.`category_id` = `categories`.`id` and `categories`.`deleted_at` is null) and `published` = 1 and `popular` = 1 and `courses`.`deleted_at` is null limit 6
select * from `courses` where `published` = 1 and exists (select * from `categories` where `courses`.`category_id` = `categories`.`id` and `categories`.`deleted_at` is null) and `featured` = 1 and `courses`.`deleted_at` is null limit 8
select * from `categories` where `icon` != '' and `categories`.`deleted_at` is null limit 12
select * from `courses` where `courses`.`category_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10) and `courses`.`deleted_at` is null
select * from `courses` where exists (select * from `categories` where `courses`.`category_id` = `categories`.`id` and `categories`.`deleted_at` is null) and `published` = 1 and `trending` = 1 and `courses`.`deleted_at` is null limit 2
select `courses`.*, `course_user`.`user_id` as `pivot_user_id`, `course_user`.`course_id` as `pivot_course_id` from `courses` inner join `course_user` on `courses`.`id` = `course_user`.`course_id` where `course_user`.`user_id` in (2) and `courses`.`deleted_at` is null and exists (select * from `users` inner join `course_user` on `users`.`id` = `course_user`.`user_id` where `courses`.`id` = `course_user`.`course_id` and `course_user`.`user_id` = 2 and `users`.`deleted_at` is null)
select * from `sponsors` where `status` = 1
select * from `blogs` order by `created_at` desc limit 2
select * from `categories` where `categories`.`deleted_at` is null
select * from `faqs` where `faqs`.`category_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)
select * from `testimonials` where `status` = 1 order by `created_at` desc
select * from `reasons` where `status` = 1 order by `created_at` desc
---
    public function index()
    {
        if (request('page')) {
            $page = Page::where('slug', '=', request('page'))
                ->where('published', '=', 1)->first();
            if ($page != "") {
                return view($this->path.'.pages.index', compact('page'));
            }
            abort(404);
        }
        $type = config('theme_layout');
        $sections = Config::where('key', '=', 'layout_' . $type)->first();
        $sections = json_decode($sections->value);

        $popular_courses = Course::withoutGlobalScope('filter')
            ->whereHas('category')
            ->where('published', '=', 1)
            ->where('popular', '=', 1)->take(6)->get();

        $featured_courses = Course::withoutGlobalScope('filter')->where('published', '=', 1)
            ->whereHas('category')
            ->where('featured', '=', 1)->take(8)->get();

        $course_categories = Category::with('courses')->where('icon', '!=', "")->take(12)->get();

        $trending_courses = Course::withoutGlobalScope('filter')
            ->whereHas('category')
            ->where('published', '=', 1)
            ->where('trending', '=', 1)->take(2)->get();

        $teachers = User::role('teacher')->with('courses')->where('active', '=', 1)->take(7)->get();

        $sponsors = Sponsor::where('status', '=', 1)->get();

        $news = Blog::orderBy('created_at', 'desc')->take(2)->get();

        $faqs = Category::with('faqs')->get()->take(6);

        $testimonials = Testimonial::where('status', '=', 1)->orderBy('created_at', 'desc')->get();

        $reasons = Reason::where('status', '=', 1)->orderBy('created_at', 'desc')->get();