app/Providers/AppServiceProvider.php

select * from `admin_menu_items` where `menu` = '1' order by `sort` asc
---

        view()->composer(['frontend.layouts.*', 'frontend-rtl.layouts.*'], function ($view) {
            $menu_name = NULL;
            $custom_menus = MenuItems::where('menu', '=', config('nav_menu'))
                ->orderBy('sort')
                ->get();

select * from `courses` where exists (select * from `categories` where `courses`.`category_id` = `categories`.`id` and `categories`.`deleted_at` is null) and `published` = 1 and `featured` = 1 and `trending` = 1 and `courses`.`deleted_at` is null limit 1
select * from `courses` where `published` = 1 and exists (select * from `categories` where `courses`.`category_id` = `categories`.`id` and `categories`.`deleted_at` is null) and `featured` = 1 and `courses`.`deleted_at` is null limit 8
---

        view()->composer(['frontend.*', 'frontend-rtl.*'], function ($view) {

            $global_featured_course = Course::withoutGlobalScope('filter')
                ->whereHas('category')
                ->where('published', '=', 1)
                ->where('featured', '=', 1)->where('trending', '=', 1)->first();

            $featured_courses = Course::withoutGlobalScope('filter')->where('published', '=', 1)
                ->whereHas('category')
                ->where('featured', '=', 1)->take(8)->get();